In [1]:
#dependencies
import pandas as pd

In [2]:
#importing data
school_cvspath = 'Resources\schools_complete.csv'
student_cvspath = 'Resources\students_complete.csv'

In [3]:
#Using Pandas to read data
school_data = pd.read_csv(school_cvspath)
student_data = pd.read_csv(student_cvspath)

In [4]:
#initial viewing of data
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
#initial viewing of data
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
#Checking columns actual names
student_data.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')

In [7]:
#Checking columns actual names
school_data.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [8]:
#Cleaning up column names.
student_data = student_data.rename(columns={
    'student_name' : 'Student Name',
    'gender' : 'Gender',
    'grade' : 'Grade',
    'school_name' : 'School Name',
    'reading_score' : 'Reading Score',
    'math_score' : "Math Score"
})

In [9]:
#Rechecking cleaned data
student_data.head()

,Student ID,Student Name,Gender,Grade,School Name,Reading Score,Math Score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [10]:
#Cleaning up column names.
school_data = school_data.rename(columns={
    'school_name' : 'School Name',
    'type' : 'Type',
    'size' : 'Size',
    'budget' : 'Budget',
})

In [11]:
#Rechecking cleaned data
school_data.head()

   School ID            School Name      Type  Size   Budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [12]:
#Initial Statistics inquiries

#total_students = student_data['Student Name'].count()
#does not account for duplicates. Code below accounts for duplicates. Although both produce the same answer in this case because there was no duplicates.
total_students = len(student_data['Student Name'].unique())
student_info = student_data['Student Name'].value_counts()
best_reading_score = student_data['Reading Score'].max()
worst_reading_score = student_data['Reading Score'].min()
avg_reading_score = student_data['Reading Score'].mean()
best_math_score = student_data['Math Score'].max()
worst_math_score = student_data['Math Score'].min()
avg_math_score = student_data['Math Score'].mean()

print(total_students)
print(student_info)
print(best_reading_score)
print(worst_reading_score)
print(avg_reading_score)
print(best_math_score)
print(worst_math_score)
print(avg_math_score)

32715
Michael Smith           26
David Johnson           16
Michael Williams        16
David Smith             15
Daniel Johnson          14
Michael Johnson         13
Michael Brown           13
Michael Martinez        12
Jennifer Anderson       11
Lisa Smith              11
Michelle Smith          11
Jessica Smith           11
Amanda Johnson          10
Michael Miller          10
Michael Davis           10
John Smith              10
John Johnson            10
James Smith             10
Thomas Smith            10
Robert Jones            10
Jennifer Johnson         9
Robert Smith             9
Michael Clark            9
David Miller             9
Jessica Johnson          9
William Smith            9
James Williams           9
Matthew Smith            9
Christopher Williams     9
Lisa Johnson             8
                        ..
James Hansen             1
Juan White               1
Linda Fisher             1
Jamie Mckay              1
Brittany Bradley         1
Barbara Hendrix          1
Jacqueline Snow MD       1
Michele Glass            1
Jon Mitchell             1
Kelly Ellison            1
Jorge Daniel             1
Caroline Vincent         1
Olivia Hurley            1
Nancy Vasquez            1
Amy Schaefer             1
Judith Lee               1
Ian Walker               1
Teresa Morgan            1
Lawrence Herrera         1
Jessica Sutton           1
Patrick Owens            1
Ronald Price             1
Steven Schroeder         1
Ethan Herring            1
Briana Castillo          1
Breanna Mcintyre DDS     1
Robert Shelton           1
Kristina Mason           1
Julie Clark              1
Robert Brock             1
Name: Student Name, Length: 32715, dtype: int64
99
63
81.87784018381414
99
55
78.98537145774827

In [13]:
#Rounding Average - Data Cleanup
avg_reading_score = round(avg_reading_score, 0)
avg_math_score = round(avg_math_score, 0)

print(avg_reading_score)
print(avg_math_score)

82.0
79.0

In [14]:
#Additional Statistics
budget = school_data['Budget'].count()
print(budget)
budget_total = school_data['Budget'].sum()
budget_total

15

24649428

In [15]:
#Per student budget
per_student = total_students / budget_total
per_student

0.0013272113251471798

In [16]:
#merging on School Name for single data set.
schools_merge = pd.merge(student_data, school_data, on="School Name")
schools_merge.head()

,Student ID,Student Name,Gender,Grade,School Name,Reading Score,Math Score,School ID,Type,Size,Budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [17]:
# More stats
#total_schools = school_data["School Name"].count()
#does not account for duplicates. Code below accounts for duplicates. Although both produce the same answer in this case because there was no duplicates.
total_schools = len(school_data["School ID"].unique())
print(total_schools)

#Calculate the percentage of students with a passing math score (70 or greater)
#Calculate the percentage of students with a passing reading score (70 or greater)
#Create 1s  for the passing students by math or reading. 0 otherwise. And take the mean to get the average. It will give the percent of the passing students.
student_data["math_pass"] = student_data["Math Score"] >= 70
student_data["reading_pass"] = student_data["Reading Score"] >= 70
percent_passing_math = ((student_data["math_pass"]).mean())*100
percent_passing_reading = ((student_data["reading_pass"]).mean())*100
percent_passing_math = round(percent_passing_math, 2)
percent_passing_reading = round(percent_passing_reading, 2)
overall_pass = (percent_passing_reading + percent_passing_math ) / 2
print(percent_passing_reading)
print(percent_passing_math)
print(overall_pass)

15
85.81
74.98
80.39500000000001

SyntaxError: invalid syntax (<ipython-input-18-0700b33afb43>, line 1)

In [20]:
# Creating a summary DataFrame using above values
district_summary_df = pd.DataFrame({
    'Total Schools' : [total_schools],
    'Total Students' : [total_students],
    'Total Budget' : [budget_total],
    'Average Math Score' : [avg_math_score],
    'Average Reading Score' : [avg_reading_score],
    '% Passing Math' : [percent_passing_math],
    '% Passing Reading' : [percent_passing_reading],
    '% Overall Passing Rate' : [overall_pass],
})

#Formatting.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:,.2f}%".format)
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:,.2f}%".format)
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:}%".format)
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:}%".format)
district_summary_df["% Overall Passing Rate"] = district_summary_df["% Overall Passing Rate"].map("{:,.2f}%".format)

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"32,715","$24,649,428.00",79.0%,82.0%,74.98%,85.81%,80.40%